---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType
source: html/dd6f3990-d050-01e1-6272-f6183c31a97c.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType

An enumerated type describing where an ancillary is used on a fabrication part.

## Syntax (C#)
```csharp
public enum FabricationAncillaryUsageType
```